//1) Заполнить массив случайными числами. Подсчитать:
//- количество элементов которые больше своего соседа слева
//- количество четных элементов
//- количество элементов которые меньше среднего арифметического
//2) Попросить пользователя ввести строку и имя файла. Записать строку в файл.
//3*) Написать метод который ищет при помощи бинарного поиска есть ли число в
//отсортированном массиве
//4*) Подсчитать количество треугольников, у которых стороны заданы целыми числами,
// и площадь которых не больше 100.
//4.1*) Сделать задание так чтобы не было повторяющихся треугольников,
//например (3,4,5) и (5,3,4) - повторяющиеся.
package com.p0n0marenk0;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
